Autodesk.Revit.DB.GenericForm.Subcategory
The subcategory.
Remarks: The subcategory can be set to either the family category or one of its subcategories.

Autodesk.Revit.DB.GenericForm.SetVisibility(Autodesk.Revit.DB.FamilyElementVisibility)
Sets the visibility for the generic form.
Remarks: The visibility of the generic form geometry can be changed for different
types of views and detail levels in the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when visibility is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when regeneration failed.

Autodesk.Revit.DB.GenericForm.GetVisibility
Gets the visibility for the generic form.
Returns: A copy of visibility settings for the generic form.

Autodesk.Revit.DB.GenericForm.Name
Get and Set the Name property
Remarks: The method set is override to forbid the user to change the Name. When the user tries
to call the method set for GenericForm object, an InvalidOperationException will be thrown.

Autodesk.Revit.DB.GenericForm.IsSolid
Identifies if the GenericForm is a solid or a void element.
True if the form is a solid, false if the solid is a void element.

Autodesk.Revit.DB.GenericForm.Visible
The visibility of the GenericForm.
True if the form is visible, false if it is hidden.

Autodesk.Revit.DB.GenericForm
Provides access to the Generic Form model in Autodesk Revit.
Remarks: The Generic Form object can be queried for a generic form for use in family modeling and
massing. It is the base class of Sweep, Blend, Extrusion, Revolution.